{"config": [{"config": {"bias_constraint": null, "batch_input_shape": [null, 256, 256, 3], "kernel_size": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "activation": "elu", "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_5", "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "trainable": true, "kernel_size": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activation": "elu", "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_6", "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "trainable": true, "kernel_size": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activation": "elu", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_7", "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "trainable": true, "kernel_size": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_8", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activation": "elu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_8", "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "use_bias": true, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_4", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "use_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}